USE [БД.ПО4.190333-билет4];
GO

DROP PROCEDURE IF EXISTS Билет4_Задание3;
GO

CREATE PROCEDURE Билет4_Задание3
	@КодВладельца INT,
	@ФиоВладельца VARCHAR(100) OUTPUT
AS
BEGIN
	SET @ФиоВладельца = (
		SELECT CONCAT(фамилия, ' ', имя, ' ', отчество)
		FROM СПР_Владельцы
		WHERE id = @КодВладельца
	);
END;
GO

-- = = = = = = = =

DECLARE @переменнаяФиоВладельца VARCHAR(100);

-- = = = = = = = =

EXEC Билет4_Задание3 1, @ФиоВладельца=@переменнаяФиоВладельца OUTPUT;

PRINT 'Fio vladelca: '+ @переменнаяФиоВладельца;

SELECT @переменнаяФиоВладельца AS ФиоВладельца;

-- = = = = = = = =

EXEC Билет4_Задание3 3, @ФиоВладельца=@переменнаяФиоВладельца OUTPUT;

PRINT 'Fio vladelca: '+ @переменнаяФиоВладельца;

SELECT @переменнаяФиоВладельца AS ФиоВладельца;
