USE [БД.ПО4.190333-билет3];

DROP PROCEDURE IF EXISTS Билет3_Задание3;
GO

CREATE PROCEDURE Билет3_Задание3
	@КодЗаконодателя INT,
	@ФилЗаконодателя VARCHAR(100) OUTPUT,
	@ДомашнийТелефонЗаконодателя VARCHAR(64) OUTPUT,
	@СлужебныйТелефонЗаконодателя VARCHAR(64) OUTPUT
AS
BEGIN
	SET @ФилЗаконодателя = (
		SELECT CONCAT(фамилия, ' ', имя, ' ', отчество)
		FROM СПР_Законодатели
		WHERE id = @КодЗаконодателя
	);
	SET @ДомашнийТелефонЗаконодателя = (
		SELECT домашнийТелефон
		FROM СПР_Законодатели
		WHERE id = @КодЗаконодателя
	);
	SET @СлужебныйТелефонЗаконодателя = (
		SELECT служебныйТелефон
		FROM СПР_Законодатели
		WHERE id = @КодЗаконодателя
	);
END;
GO

-- = = = = = = = =

DECLARE @переменнаяФио VARCHAR(100);
DECLARE @переменнаяДомашнийТелефон VARCHAR(64);
DECLARE @переменнаяСлужебныйТелефон VARCHAR(64);

-- = = = = = = = =

EXEC Билет3_Задание3
	1,
	@ФилЗаконодателя=@переменнаяФио OUTPUT,
	@ДомашнийТелефонЗаконодателя=@переменнаяДомашнийТелефон OUTPUT,
	@СлужебныйТелефонЗаконодателя=@переменнаяСлужебныйТелефон OUTPUT;

PRINT 'Fio zakonodatelay: ' + @переменнаяФио;
PRINT 'Telephone domashii zakonodatelay: ' + @переменнаяДомашнийТелефон;
PRINT 'Telephone slyjebnii zakonodatelay: ' + @переменнаяСлужебныйТелефон;

SELECT
	@переменнаяФио AS ФиоЗаконодателя,
	@переменнаяДомашнийТелефон AS ДомашнийТелефонЗаконодателя,
	@переменнаяСлужебныйТелефон AS СлужебныйТелефонЗаконодателя;

-- = = = = = = = =

EXEC Билет3_Задание3
	2,
	@ФилЗаконодателя=@переменнаяФио OUTPUT,
	@ДомашнийТелефонЗаконодателя=@переменнаяДомашнийТелефон OUTPUT,
	@СлужебныйТелефонЗаконодателя=@переменнаяСлужебныйТелефон OUTPUT;

PRINT 'Fio zakonodatelay: ' + @переменнаяФио;
PRINT 'Telephone domashii zakonodatelay: ' + @переменнаяДомашнийТелефон;
PRINT 'Telephone slyjebnii zakonodatelay: ' + @переменнаяСлужебныйТелефон;

SELECT
	@переменнаяФио AS ФиоЗаконодателя,
	@переменнаяДомашнийТелефон AS ДомашнийТелефонЗаконодателя,
	@переменнаяСлужебныйТелефон AS СлужебныйТелефонЗаконодателя;
